app/controllers/bookmarks_controller.rb

SELECT * FROM "bookmarks"
---
  def index
    @bookmarks = Bookmark.all

SELECT * FROM "bookmarks" WHERE ("bookmarks"."id" = 1)
---
  def show
    @bookmark = Bookmark.find(params[:id])

SELECT * FROM "bookmarks" WHERE ("bookmarks"."id" = 1)
---
  def edit
    @bookmark = Bookmark.find(params[:id])

INSERT INTO "bookmarks" ("created_at", "title", "author", "updated_at", "url", "description") VALUES('2010-04-06 19:17:27', 'abc', 'sdf', '2010-04-06 19:17:27', 'fsdf', 'sdf')
---
  def create
    @bookmark = Bookmark.new(params[:bookmark])


    respond_to do |format|
      if @bookmark.save

SELECT * FROM "bookmarks" WHERE ("bookmarks"."id" = 1)
UPDATE "bookmarks" SET "updated_at" = '2010-04-14 01:03:38', "url" = 'http://www.google.com' WHERE "id" = 1
---
  def update
    @bookmark = Bookmark.find(params[:id])

    tagsString = params[:bookmark_tags]

    save_tagstring_to_tags(tagsString, @bookmark.id)

    #Marktags.delete_all(["bookmark_id = ?", @bookmark.id])
    #if (tagsString.length > 0)
    #  @tagsArr = tagsString.split(',');
    #  @tagsArr.each do |tag|
    #    if (Tags.find_by_name(tag))
    #      @tagID = Tags.find_by_name(tag).id
    #    else
    #      @aTag = Tags.new(:name => tag)
    #      @aTag.save
    #      @tagID = @aTag.id
    #    end
    #
    #    Marktags.new(:bookmark_id => @bookmark.id, :tag_id => @tagID).save
    #
    #  end
    #end

    respond_to do |format|
      if @bookmark.update_attributes(params[:bookmark])

SELECT * FROM "bookmarks" WHERE ("bookmarks"."id" = 1)
DELETE FROM "bookmarks" WHERE "id" = 1
---
  def destroy
    @bookmark = Bookmark.find(params[:id])
    @bookmark.destroy