app/controllers/tags_controller.rb

SELECT * FROM "tags"
SELECT count(*) AS count_all FROM "bookmarks" INNER JOIN "marktags" ON "bookmarks".id = "marktags".bookmark_id WHERE (("marktags".tag_id = 5))
---
  def index
    #size constants
    minSize = 1
    maxSize = 3

    tags = Tag.all(:include => :bookmarks)
    @tags = tags.sort! { |a,b| b.bookmarks.count <=> a.bookmarks.count }

SELECT * FROM "tags" WHERE ("tags"."id" = 5)
---
  def show
    @tag = Tag.find(params[:id])

SELECT * FROM "tags" WHERE (name like '%blah%')
---
  def search
    @tags = Tag.find :all, :conditions => ["name like ?", "%#{params[:q]}%"]